/* automatically generated by rust-bindgen 0.58.1 */

pub const AUBIO_SMPL_FMT: &'static [u8; 4usize] = b"%lf\0";
pub const AUBIO_LSMP_FMT: &'static [u8; 4usize] = b"%Lf\0";
pub type smpl_t = f64;
pub type lsmp_t = f64;
#[doc = " unsigned integer"]
pub type uint_t = ::std::os::raw::c_uint;
#[doc = " signed integer"]
pub type sint_t = ::std::os::raw::c_int;
#[doc = " character"]
pub type char_t = ::std::os::raw::c_char;
#[doc = " Buffer for real data"]
#[doc = ""]
#[doc = "Vector of real-valued data"]
#[doc = ""]
#[doc = "::fvec_t is is the structure used to store vector of real-valued data, ::smpl_t ."]
#[doc = ""]
#[doc = "\\code"]
#[doc = ""]
#[doc = "uint_t buffer_size = 1024;"]
#[doc = ""]
#[doc = "fvec_t * input = new_fvec (buffer_size);"]
#[doc = ""]
#[doc = "input->data[23] = 2.;"]
#[doc = ""]
#[doc = "mean = fvec_mean(a_vector);"]
#[doc = ""]
#[doc = "del_fvec(a_vector);"]
#[doc = ""]
#[doc = "\\endcode"]
#[doc = ""]
#[doc = "See `examples/` and `tests/src` directories for more examples."]
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fvec_t {
    #[doc = "< length of buffer"]
    pub length: uint_t,
    #[doc = "< data vector of length ::fvec_t.length"]
    pub data: *mut smpl_t,
}
#[test]
fn bindgen_test_layout_fvec_t() {
    assert_eq!(
        ::std::mem::size_of::<fvec_t>(),
        16usize,
        concat!("Size of: ", stringify!(fvec_t))
    );
    assert_eq!(
        ::std::mem::align_of::<fvec_t>(),
        8usize,
        concat!("Alignment of ", stringify!(fvec_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fvec_t>())).length as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fvec_t),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fvec_t>())).data as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fvec_t),
            "::",
            stringify!(data)
        )
    );
}
extern "C" {
    #[doc = " fvec_t buffer creation function"]
    #[doc = ""]
    #[doc = "\\param length the length of the buffer to create"]
    pub fn new_fvec(length: uint_t) -> *mut fvec_t;
}
extern "C" {
    #[doc = " fvec_t buffer deletion function"]
    #[doc = ""]
    #[doc = "\\param s buffer to delete as returned by new_fvec()"]
    pub fn del_fvec(s: *mut fvec_t);
}
extern "C" {
    #[doc = " read sample value in a buffer"]
    #[doc = ""]
    #[doc = "\\param s vector to read from"]
    #[doc = "\\param position sample position to read from"]
    pub fn fvec_get_sample(s: *const fvec_t, position: uint_t) -> smpl_t;
}
extern "C" {
    #[doc = " write sample value in a buffer"]
    #[doc = ""]
    #[doc = "\\param s vector to write to"]
    #[doc = "\\param data value to write in s->data[position]"]
    #[doc = "\\param position sample position to write to"]
    pub fn fvec_set_sample(s: *mut fvec_t, data: smpl_t, position: uint_t);
}
extern "C" {
    #[doc = " read data from a buffer"]
    #[doc = ""]
    #[doc = "\\param s vector to read from"]
    pub fn fvec_get_data(s: *const fvec_t) -> *mut smpl_t;
}
extern "C" {
    #[doc = " print out fvec data"]
    #[doc = ""]
    #[doc = "\\param s vector to print out"]
    pub fn fvec_print(s: *const fvec_t);
}
extern "C" {
    #[doc = " set all elements to a given value"]
    #[doc = ""]
    #[doc = "\\param s vector to modify"]
    #[doc = "\\param val value to set elements to"]
    pub fn fvec_set_all(s: *mut fvec_t, val: smpl_t);
}
extern "C" {
    #[doc = " set all elements to zero"]
    #[doc = ""]
    #[doc = "\\param s vector to modify"]
    pub fn fvec_zeros(s: *mut fvec_t);
}
extern "C" {
    #[doc = " set all elements to ones"]
    #[doc = ""]
    #[doc = "\\param s vector to modify"]
    pub fn fvec_ones(s: *mut fvec_t);
}
extern "C" {
    #[doc = " revert order of vector elements"]
    #[doc = ""]
    #[doc = "\\param s vector to revert"]
    pub fn fvec_rev(s: *mut fvec_t);
}
extern "C" {
    #[doc = " apply weight to vector"]
    #[doc = ""]
    #[doc = "If the weight vector is longer than s, only the first elements are used. If"]
    #[doc = "the weight vector is shorter than s, the last elements of s are not weighted."]
    #[doc = ""]
    #[doc = "\\param s vector to weight"]
    #[doc = "\\param weight weighting coefficients"]
    pub fn fvec_weight(s: *mut fvec_t, weight: *const fvec_t);
}
extern "C" {
    #[doc = " make a copy of a vector"]
    #[doc = ""]
    #[doc = "\\param s source vector"]
    #[doc = "\\param t vector to copy to"]
    pub fn fvec_copy(s: *const fvec_t, t: *mut fvec_t);
}
extern "C" {
    #[doc = " make a copy of a vector, applying weights to each element"]
    #[doc = ""]
    #[doc = "\\param in input vector"]
    #[doc = "\\param weight weights vector"]
    #[doc = "\\param out output vector"]
    pub fn fvec_weighted_copy(in_: *const fvec_t, weight: *const fvec_t, out: *mut fvec_t);
}
#[doc = " Vector of real-valued phase and spectrum data"]
#[doc = ""]
#[doc = "\\code"]
#[doc = ""]
#[doc = "uint_t buffer_size = 1024;"]
#[doc = ""]
#[doc = "cvec_t * input = new_cvec (buffer_size);"]
#[doc = ""]
#[doc = "input->norm[23] = 2.;"]
#[doc = "input->phas[23] = M_PI;"]
#[doc = ""]
#[doc = "mean = cvec_mean(input);"]
#[doc = ""]
#[doc = "del_cvec (input);"]
#[doc = ""]
#[doc = "\\endcode"]
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cvec_t {
    #[doc = "< length of buffer = (requested length)/2 + 1"]
    pub length: uint_t,
    #[doc = "< norm array of size ::cvec_t.length"]
    pub norm: *mut smpl_t,
    #[doc = "< phase array of size ::cvec_t.length"]
    pub phas: *mut smpl_t,
}
#[test]
fn bindgen_test_layout_cvec_t() {
    assert_eq!(
        ::std::mem::size_of::<cvec_t>(),
        24usize,
        concat!("Size of: ", stringify!(cvec_t))
    );
    assert_eq!(
        ::std::mem::align_of::<cvec_t>(),
        8usize,
        concat!("Alignment of ", stringify!(cvec_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cvec_t>())).length as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cvec_t),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cvec_t>())).norm as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cvec_t),
            "::",
            stringify!(norm)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cvec_t>())).phas as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(cvec_t),
            "::",
            stringify!(phas)
        )
    );
}
extern "C" {
    #[doc = " cvec_t buffer creation function"]
    #[doc = ""]
    #[doc = "This function creates a cvec_t structure holding two arrays of size"]
    #[doc = "[length/2+1], corresponding to the norm and phase values of the"]
    #[doc = "spectral frame. The length stored in the structure is the actual size of both"]
    #[doc = "arrays, not the length of the complex and symmetrical vector, specified as"]
    #[doc = "creation argument."]
    #[doc = ""]
    #[doc = "\\param length the length of the buffer to create"]
    pub fn new_cvec(length: uint_t) -> *mut cvec_t;
}
extern "C" {
    #[doc = " cvec_t buffer deletion function"]
    #[doc = ""]
    #[doc = "\\param s buffer to delete as returned by new_cvec()"]
    pub fn del_cvec(s: *mut cvec_t);
}
extern "C" {
    #[doc = " write norm value in a complex buffer"]
    #[doc = ""]
    #[doc = "This is equivalent to:"]
    #[doc = "\\code"]
    #[doc = "s->norm[position] = val;"]
    #[doc = "\\endcode"]
    #[doc = ""]
    #[doc = "\\param s vector to write to"]
    #[doc = "\\param val norm value to write in s->norm[position]"]
    #[doc = "\\param position sample position to write to"]
    pub fn cvec_norm_set_sample(s: *mut cvec_t, val: smpl_t, position: uint_t);
}
extern "C" {
    #[doc = " write phase value in a complex buffer"]
    #[doc = ""]
    #[doc = "This is equivalent to:"]
    #[doc = "\\code"]
    #[doc = "s->phas[position] = val;"]
    #[doc = "\\endcode"]
    #[doc = ""]
    #[doc = "\\param s vector to write to"]
    #[doc = "\\param val phase value to write in s->phas[position]"]
    #[doc = "\\param position sample position to write to"]
    pub fn cvec_phas_set_sample(s: *mut cvec_t, val: smpl_t, position: uint_t);
}
extern "C" {
    #[doc = " read norm value from a complex buffer"]
    #[doc = ""]
    #[doc = "This is equivalent to:"]
    #[doc = "\\code"]
    #[doc = "smpl_t foo = s->norm[position];"]
    #[doc = "\\endcode"]
    #[doc = ""]
    #[doc = "\\param s vector to read from"]
    #[doc = "\\param position sample position to read from"]
    pub fn cvec_norm_get_sample(s: *mut cvec_t, position: uint_t) -> smpl_t;
}
extern "C" {
    #[doc = " read phase value from a complex buffer"]
    #[doc = ""]
    #[doc = "This is equivalent to:"]
    #[doc = "\\code"]
    #[doc = "smpl_t foo = s->phas[position];"]
    #[doc = "\\endcode"]
    #[doc = ""]
    #[doc = "\\param s vector to read from"]
    #[doc = "\\param position sample position to read from"]
    #[doc = "\\returns the value of the sample at position"]
    pub fn cvec_phas_get_sample(s: *mut cvec_t, position: uint_t) -> smpl_t;
}
extern "C" {
    #[doc = " read norm data from a complex buffer"]
    #[doc = ""]
    #[doc = "\\code"]
    #[doc = "smpl_t *data = s->norm;"]
    #[doc = "\\endcode"]
    #[doc = ""]
    #[doc = "\\param s vector to read from"]
    pub fn cvec_norm_get_data(s: *const cvec_t) -> *mut smpl_t;
}
extern "C" {
    #[doc = " read phase data from a complex buffer"]
    #[doc = ""]
    #[doc = "This is equivalent to:"]
    #[doc = "\\code"]
    #[doc = "smpl_t *data = s->phas;"]
    #[doc = "\\endcode"]
    #[doc = ""]
    #[doc = "\\param s vector to read from"]
    pub fn cvec_phas_get_data(s: *const cvec_t) -> *mut smpl_t;
}
extern "C" {
    #[doc = " print out cvec data"]
    #[doc = ""]
    #[doc = "\\param s vector to print out"]
    pub fn cvec_print(s: *const cvec_t);
}
extern "C" {
    #[doc = " make a copy of a vector"]
    #[doc = ""]
    #[doc = "\\param s source vector"]
    #[doc = "\\param t vector to copy to"]
    pub fn cvec_copy(s: *const cvec_t, t: *mut cvec_t);
}
extern "C" {
    #[doc = " set all norm elements to a given value"]
    #[doc = ""]
    #[doc = "\\param s vector to modify"]
    #[doc = "\\param val value to set elements to"]
    pub fn cvec_norm_set_all(s: *mut cvec_t, val: smpl_t);
}
extern "C" {
    #[doc = " set all norm elements to zero"]
    #[doc = ""]
    #[doc = "\\param s vector to modify"]
    pub fn cvec_norm_zeros(s: *mut cvec_t);
}
extern "C" {
    #[doc = " set all norm elements to one"]
    #[doc = ""]
    #[doc = "\\param s vector to modify"]
    pub fn cvec_norm_ones(s: *mut cvec_t);
}
extern "C" {
    #[doc = " set all phase elements to a given value"]
    #[doc = ""]
    #[doc = "\\param s vector to modify"]
    #[doc = "\\param val value to set elements to"]
    pub fn cvec_phas_set_all(s: *mut cvec_t, val: smpl_t);
}
extern "C" {
    #[doc = " set all phase elements to zero"]
    #[doc = ""]
    #[doc = "\\param s vector to modify"]
    pub fn cvec_phas_zeros(s: *mut cvec_t);
}
extern "C" {
    #[doc = " set all phase elements to one"]
    #[doc = ""]
    #[doc = "\\param s vector to modify"]
    pub fn cvec_phas_ones(s: *mut cvec_t);
}
extern "C" {
    #[doc = " set all norm and phas elements to zero"]
    #[doc = ""]
    #[doc = "\\param s vector to modify"]
    pub fn cvec_zeros(s: *mut cvec_t);
}
extern "C" {
    #[doc = " take logarithmic magnitude"]
    #[doc = ""]
    #[doc = "\\param s input cvec to compress"]
    #[doc = "\\param lambda value to use for normalisation"]
    #[doc = ""]
    #[doc = "\\f$ S_k = log( \\lambda * S_k + 1 ) \\f$"]
    pub fn cvec_logmag(s: *mut cvec_t, lambda: smpl_t);
}
#[doc = " Buffer for real data in double precision"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lvec_t {
    #[doc = "< length of buffer"]
    pub length: uint_t,
    #[doc = "< data array of size [length]"]
    pub data: *mut lsmp_t,
}
#[test]
fn bindgen_test_layout_lvec_t() {
    assert_eq!(
        ::std::mem::size_of::<lvec_t>(),
        16usize,
        concat!("Size of: ", stringify!(lvec_t))
    );
    assert_eq!(
        ::std::mem::align_of::<lvec_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lvec_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lvec_t>())).length as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lvec_t),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lvec_t>())).data as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lvec_t),
            "::",
            stringify!(data)
        )
    );
}
extern "C" {
    #[doc = " lvec_t buffer creation function"]
    #[doc = ""]
    #[doc = "\\param length the length of the buffer to create"]
    pub fn new_lvec(length: uint_t) -> *mut lvec_t;
}
extern "C" {
    #[doc = " lvec_t buffer deletion function"]
    #[doc = ""]
    #[doc = "\\param s buffer to delete as returned by new_lvec()"]
    pub fn del_lvec(s: *mut lvec_t);
}
extern "C" {
    #[doc = " read sample value in a buffer"]
    #[doc = ""]
    #[doc = "\\param s vector to read from"]
    #[doc = "\\param position sample position to read from"]
    pub fn lvec_get_sample(s: *mut lvec_t, position: uint_t) -> lsmp_t;
}
extern "C" {
    #[doc = " write sample value in a buffer"]
    #[doc = ""]
    #[doc = "\\param s vector to write to"]
    #[doc = "\\param data value to write in s->data[position]"]
    #[doc = "\\param position sample position to write to"]
    pub fn lvec_set_sample(s: *mut lvec_t, data: lsmp_t, position: uint_t);
}
extern "C" {
    #[doc = " read data from a buffer"]
    #[doc = ""]
    #[doc = "\\param s vector to read from"]
    pub fn lvec_get_data(s: *const lvec_t) -> *mut lsmp_t;
}
extern "C" {
    #[doc = " print out lvec data"]
    #[doc = ""]
    #[doc = "\\param s vector to print out"]
    pub fn lvec_print(s: *const lvec_t);
}
extern "C" {
    #[doc = " set all elements to a given value"]
    #[doc = ""]
    #[doc = "\\param s vector to modify"]
    #[doc = "\\param val value to set elements to"]
    pub fn lvec_set_all(s: *mut lvec_t, val: smpl_t);
}
extern "C" {
    #[doc = " set all elements to zero"]
    #[doc = ""]
    #[doc = "\\param s vector to modify"]
    pub fn lvec_zeros(s: *mut lvec_t);
}
extern "C" {
    #[doc = " set all elements to ones"]
    #[doc = ""]
    #[doc = "\\param s vector to modify"]
    pub fn lvec_ones(s: *mut lvec_t);
}
#[doc = " Buffer for real data"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fmat_t {
    #[doc = "< length of matrix"]
    pub length: uint_t,
    #[doc = "< height of matrix"]
    pub height: uint_t,
    #[doc = "< data array of size [length] * [height]"]
    pub data: *mut *mut smpl_t,
}
#[test]
fn bindgen_test_layout_fmat_t() {
    assert_eq!(
        ::std::mem::size_of::<fmat_t>(),
        16usize,
        concat!("Size of: ", stringify!(fmat_t))
    );
    assert_eq!(
        ::std::mem::align_of::<fmat_t>(),
        8usize,
        concat!("Alignment of ", stringify!(fmat_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fmat_t>())).length as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fmat_t),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fmat_t>())).height as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(fmat_t),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fmat_t>())).data as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fmat_t),
            "::",
            stringify!(data)
        )
    );
}
extern "C" {
    #[doc = " fmat_t buffer creation function"]
    #[doc = ""]
    #[doc = "\\param length the length of the matrix to create"]
    #[doc = "\\param height the height of the matrix to create"]
    pub fn new_fmat(height: uint_t, length: uint_t) -> *mut fmat_t;
}
extern "C" {
    #[doc = " fmat_t buffer deletion function"]
    #[doc = ""]
    #[doc = "\\param s buffer to delete as returned by new_fmat()"]
    pub fn del_fmat(s: *mut fmat_t);
}
extern "C" {
    #[doc = " read sample value in a buffer"]
    #[doc = ""]
    #[doc = "\\param s vector to read from"]
    #[doc = "\\param channel channel to read from"]
    #[doc = "\\param position sample position to read from"]
    pub fn fmat_get_sample(s: *const fmat_t, channel: uint_t, position: uint_t) -> smpl_t;
}
extern "C" {
    #[doc = " write sample value in a buffer"]
